package lesson08.home;

public class Task04 {
}










//        1) Напишите метод для считывания двухмерного массива из
//        файла (размер массива заранее неизвестен, определите его
//        сами на основе данных в файле).
//        2) Считайте из текстового файла текст на английском языке и
//        выведите статистику по частоте использования букв в тексте
//        (т. е. буква — количество использований), причем первыми
//        должны выводиться буквы используемы чаще всего.
//        3) Напишите метод для создания в файле ASCII — арта, т. е.
//        фигуры размером 40х40 символов заполненных  символами
//        образующими узор.
